## Анализ данных по Титанику

In [1]:
import pandas as pd

In [2]:
# Загрузка данных с файла
data = pd.read_csv("data/titanic.csv")
data.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [3]:
data.shape

(891, 15)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [5]:
# удаление пустых значений
df = pd.DataFrame({
    "c0": {'r0': 100, "r1": 200, "r2": 300},
    "c1": {"r1": 400, "r2": 500},
    "c2": {'r0': 100, "r2": 300},
})
df

     c0     c1     c2
r0  100    NaN  100.0
r1  200  400.0    NaN
r2  300  500.0  300.0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, r0 to r2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c0      3 non-null      int64
 1   c1      2 non-null      float64
 2   c2      2 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 96.0+ bytes

In [7]:
# удаление строк с пустыми значениями
df.dropna()

     c0     c1     c2
r2  300  500.0  300.0

In [9]:
# удаление столбцов с пустими значениями
df.dropna(axis=1)

     c0
r0  100
r1  200
r2  300

In [10]:
# замена пустых значений на другое значение
df.fillna(0)

     c0     c1     c2
r0  100    0.0  100.0
r1  200  400.0    0.0
r2  300  500.0  300.0

In [13]:
# удаление строк по индексам
# df.drop(["r0", "r2"])
df.drop("r0")

     c0     c1     c2
r1  200  400.0    NaN
r2  300  500.0  300.0

 - Очистка данных

In [17]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [15]:
# вывод ключей
data.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [19]:
# удаление не нужных столбцов
data_1 = data.drop(['sibsp', 'parch', 'embarked', 'class', 'adult_male', 'deck', 'alive'], axis=1)
data_1.head()

   survived  pclass     sex   age     fare    who  embark_town  alone
0         0       3    male  22.0   7.2500    man  Southampton  False
1         1       1  female  38.0  71.2833  woman    Cherbourg  False
2         1       3  female  26.0   7.9250  woman  Southampton   True
3         1       1  female  35.0  53.1000  woman  Southampton  False
4         0       3    male  35.0   8.0500    man  Southampton   True

In [21]:
data_1.columns

Index(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone'],
      dtype='object')

In [23]:
# проверка на дубликаты
data_1.duplicated(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone']).sum()

112

In [24]:
# удаление дубликатов
data_1.drop_duplicates(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone'], inplace=True)
data_1.shape

(779, 8)

- анализ данных

In [25]:
data_1.columns

Index(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone'],
      dtype='object')

In [26]:
#сколько выживших в этой таблице
num_surv = data_1['survived'].sum()
num_surv

321

In [27]:
# процент выживаемости
num_surv / data_1.shape[0] * 100

41.206675224646986

In [30]:
# минимальный, средний и максимальный возрасты
data_1['age'].min(), data_1['age'].mean(), data_1['age'].max()

(0.42, 29.81275147928994, 80.0)

In [31]:
data_1.columns

Index(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone'],
      dtype='object')

In [33]:
# вычислить значение по столбцу'survived' при условии  'age' == 0.42
# комбинация маскирования по строкам и индексации по столбцам
mask = data_1['age'] == 0.42
data_1.loc[mask, 'survived']

803    1
Name: survived, dtype: int64

In [36]:
mask = (data_1['age'] > 0.42) & (data_1['age'] <= 1)
data_1.loc[mask, 'survived']

78     1
164    0
172    1
183    1
305    1
381    1
386    0
469    1
755    1
788    1
827    1
831    1
Name: survived, dtype: int64

In [37]:
# комбинация маскирования по строкам и среза по столбцам
mask = data_1['age'] == 0.42
data_1.loc[mask, :]

     survived  pclass   sex   age    fare    who embark_town  alone
803         1       3  male  0.42  8.5167  child   Cherbourg  False

In [38]:
mask = data_1['age'] == 80
data_1.loc[mask, :]

     survived  pclass   sex   age  fare  who  embark_town  alone
630         1       1  male  80.0  30.0  man  Southampton   True

In [39]:
# уникальные значения по столбцу 'embark_town'
data_1["embark_town"].unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [41]:
# прихотливая индексация (fancy indices)
import numpy as np

arr_1 = np.arange(10, 20)
arr_1

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19])

In [42]:
arr_1[[0, 2, 5, 1, 0, 3]]

array([10, 12, 15, 11, 10, 13])

In [43]:
data_1.columns

Index(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone'],
      dtype='object')

In [44]:
# комбинация индексаии по строкам и прихотливой индексации по столбцам
data_1.loc[164, ['survived', 'sex', 'age', 'who', 'embark_town', 'pclass']]

survived                 0
sex                   male
age                    1.0
who                  child
embark_town    Southampton
pclass                   3
Name: 164, dtype: object

In [46]:
# GroupBy

data_1.groupby('survived')[['age', 'pclass']].mean()

                age    pclass
survived
0         30.874046  2.486900
1         28.338940  1.900312

In [48]:
data_1.groupby('survived').aggregate({"age": "mean", "pclass": np.max})

                age  pclass
survived
0         30.874046       3
1         28.338940       3

In [49]:
data_1.groupby(['survived', "who"])[['age', 'pclass']].mean()

                      age    pclass
survived who
0        child   7.220588  2.941176
         man    33.533871  2.385675
         woman  30.459184  2.836066
1        child   5.883750  2.395833
         man    34.098592  1.917647
         woman  32.417683  1.765957